modm-ext/data.modm.io/docs/svd/header_stm32u535xx.svd
        <register>
          <name>JDR2</name>
          <description>ADC injected data register 2</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATA</name>
              <description>ADC Injected DATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR3</name>
          <description>ADC injected data register 3</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATA</name>
              <description>ADC Injected DATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR4</name>
          <description>ADC injected data register 4</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATA</name>
              <description>ADC Injected DATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD2CR</name>
          <description>ADC Analog Watchdog 2 Configuration Register</description>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AWD2CH</name>
              <description>ADC Analog watchdog 2 channel selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD3CR</name>
          <description>ADC Analog Watchdog 3 Configuration Register</description>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AWD3CH</name>
              <description>ADC Analog watchdog 2 channel selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LTR1</name>
          <description>ADC watchdog Lower threshold register 1</description>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LT</name>
              <description>ADC Analog watchdog 1, 2 and 3 lower threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HTR1</name>
          <description>ADC watchdog higher threshold register 1</description>
          <addressOffset>0xac</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HT</name>
              <description>ADC Analog watchdog 1,2 and 3 higher threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
            </field>
            <field>
              <name>AWDFILT</name>
              <description>Analog watchdog filtering parameter, HTR1 only</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LTR2</name>
          <description>ADC watchdog Lower threshold register 2</description>
          <addressOffset>0xb0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LT</name>
              <description>ADC Analog watchdog 1, 2 and 3 lower threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HTR2</name>
          <description>ADC watchdog Higher threshold register 2</description>
          <addressOffset>0xb4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HT</name>
              <description>ADC Analog watchdog 1,2 and 3 higher threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
            </field>
            <field>
              <name>AWDFILT</name>
              <description>Analog watchdog filtering parameter, HTR1 only</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LTR3</name>
          <description>ADC watchdog Lower threshold register 3</description>
          <addressOffset>0xb8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LT</name>
              <description>ADC Analog watchdog 1, 2 and 3 lower threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HTR3</name>
          <description>ADC watchdog Higher threshold register 3</description>
          <addressOffset>0xbc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HT</name>
              <description>ADC Analog watchdog 1,2 and 3 higher threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
            </field>
            <field>
              <name>AWDFILT</name>
              <description>Analog watchdog filtering parameter, HTR1 only</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIFSEL</name>
          <description>ADC Differential Mode Selection Register</description>
          <addressOffset>0xc0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DIFSEL</name>
              <description>ADC differential modes for channels 1 to 18</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CALFACT</name>
          <description>ADC Calibration Factors</description>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>I_APB_ADDR</name>
              <description>ADC calibration factors in single-ended mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>VALIDITY</name>
              <description>ADC calibration factors in differential mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LATCH_COEF</name>
              <description>ADC calibration factors in differential mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAPTURE_COEF</name>
              <description>ADC calibration factors in differential mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CALFACT2</name>
          <description>ADC Linearity Calibration Factors</description>
          <addressOffset>0xc8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CALFACT</name>
              <description>ADC Linearity calibration factors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OR</name>
          <description>ADC Option Register</description>
          <addressOffset>0xd0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHN0SEL</name>
              <description>ADC Channel 0 selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
