modm-ext/data.modm.io/docs/svd/header_stm32u535xx.svd
        <register>
          <name>SRDAMR</name>
          <description>SRD Autonomous Mode Register</description>
          <addressOffset>0xd8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SPI3AMEN</name>
              <description>SPI3 Autonomous Mode Enable in Stop 0,1,2 Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPUART1AMEN</name>
              <description>LPUART1 Autonomous Mode Enable in Stop 0,1,2 Mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C3AMEN</name>
              <description>I2C3 Autonomous Mode Enable in Stop 0,1,2 Mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM1AMEN</name>
              <description>LPTIM1 Autonomous Mode Enable in Stop 0,1,2 Mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM3AMEN</name>
              <description>LPTIM3 Autonomous Mode Enable in Stop 0,1,2 Mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM4AMEN</name>
              <description>LPTIM4 Autonomous Mode Enable in Stop 0,1,2 Mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPAMPAMEN</name>
              <description>OPAMP Autonomous Mode Enable in Stop 0,1,2 Mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPAMEN</name>
              <description>COMP Autonomous Mode Enable in Stop 0,1,2 Mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREFAMEN</name>
              <description>VREFBUF Autonomous Mode Enable in Stop 0,1,2 Mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCAPBAMEN</name>
              <description>RTC Autonomous Mode Enable in Stop 0,1,2 Mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC4AMEN</name>
              <description>ADC4 Autonomous Mode Enable in Stop 0,1,2 Mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPGPIO1AMEN</name>
              <description>LPGPIO1 Autonomous Mode Enable in Stop 0,1,2 Mode</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DAC1AMEN</name>
              <description>DAC1 Autonomous Mode Enable in Stop 0,1,2 Mode</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPDMA1AMEN</name>
              <description>LPDMA1 Autonomous Mode Enable in Stop 0,1,2 Mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADF1AMEN</name>
              <description>ADF1 Autonomous Mode Enable in Stop 0,1,2 Mode</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM4AMEN</name>
              <description>SRAM4 Autonomous Mode Enable in Stop 0,1,2 Mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR1</name>
          <description>IPs Clocks Configuration Register 1</description>
          <addressOffset>0xe0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USART1SEL</name>
              <description>USART1SEL[1:0]: bits (USART1 Kernel Clock Source Selection)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>USART3SEL</name>
              <description>USART3SEL[1:0]: bits (USART3 Kernel Clock Source Selection)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>UART4SEL</name>
              <description>UART4SEL[1:0]: bits (UART4 Kernel Clock Source Selection)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>UART5SEL</name>
              <description>UART5SEL[1:0]: bits (UART5 Kernel Clock Source Selection)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>I2C1SEL</name>
              <description>I2C1SEL[1:0]: bits (I2C1 Kernel Clock Source Selection)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>I2C2SEL</name>
              <description>I2C2SEL[1:0]: bits (I2C2 Kernel Clock Source Selection)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>I2C4SEL</name>
              <description>I2C4SEL[1:0]: bits (I2C4 Kernel Clock Source Selection)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SPI2SEL</name>
              <description>SPI2SEL[1:0]: bits (SPI2 Kernel Clock Source Selection)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LPTIM2SEL</name>
              <description>LPTIM2SEL[1:0]: bits (Low-power Timer 2 Kernel Clock Source Selection)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SPI1SEL</name>
              <description>SPI1SEL[1:0]: bits (SPI1 Kernel Clock Source Selection)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SYSTICKSEL</name>
              <description>SYSTICKSEL[1:0]: bits (SYSTICK Clock Source Selection)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LSI</name>
                  <description>LSI clock used as SYSTICK clock source</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>LSE clock used as SYSTICK clock source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCLKDIV8</name>
                  <description>HCLKDIV8 clock used as SYSTICK clock source</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDCANSEL</name>
              <description>FDCAN1SEL[1:0]: bits (FDCAN1 Kernel Clock Source Selection)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>HSE clock used as FDCAN kernel clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL1</name>
                  <description>PLL1 Q clock used as FDCAN kernel clock source</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2</name>
                  <description>PLL2 P clock used as FDCAN kernel clock source</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICLKSEL</name>
              <description>ICLKSEL[1:0]: bits (48 MHz Clock Source Selection)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI48</name>
                  <description>HSI48 clock used as SDMMC1/2 clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL1</name>
                  <description>PLL1 "Q" clock used as SDMMC1/2 clock source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2</name>
                  <description>PLL2 "Q" clock used as SDMMC1/2 clock source</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIK</name>
                  <description>MSIK clock used as SDMMC1/2 clock source</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMICSEL</name>
              <description>TIMICSEL[2:0]: bits (Clocks Sources for TIM16,TIM17 and LPTIM2 Internal Input Capture)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No clock available for TIM16/TIM17 and LPTIM2 input capture</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI_DIV256</name>
                  <description>HSI/256 selected for TIM16/TIM17 and LPTIM2 input capture</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIS_DIV4</name>
                  <description>MSIS/4 selected for TIM16/TIM17 and LPTIM2 input capture</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIK_DIV4</name>
                  <description>MSIK/4 selected for TIM16/TIM17 and LPTIM2 input capture</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIK_DIV1024</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR2</name>
          <description>IPs Clocks Configuration Register 2</description>
          <addressOffset>0xe4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MDF1SEL</name>
              <description>MDF1SEL[2:0]: bits (MDF1 Kernel Clock Source Selection)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HCLK</name>
                  <description>HCLK clock used as MDF1 clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL1</name>
                  <description>PLL1 clock used as MDF1 clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3</name>
                  <description>PLL3 clock used as MDF1 clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIK</name>
                  <description>MSIK clock used as MDF1 clock</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN</name>
                  <description>PIN SAI1_EXTCLK clock used as MDF1 clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI1SEL</name>
              <description>SAI1SEL[2:0]: bits (SAI1 Kernel Clock Source Selection)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>RNGSEL</name>
              <description>RNGSEL[1:0]: bits (RNGSEL Kernel Clock Source Selection)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI48</name>
                  <description>HSI48 clock used as RNG clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI48_DIV2</name>
                  <description>HSI48/2 clock used as RNG clock source</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>HSI clock used as RNG clock source</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDMMCSEL</name>
              <description>SDMMC1 Kernel Clock Source Selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KERNELCLKSOURCE_48CLK</name>
                  <description>48MHz clock from internal multiplexor used as SDMMC1/2 clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL1</name>
                  <description>PLL1 "P" used as SDMMC1/2 clock source</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCTOSPISEL</name>
              <description>OCTOSPISEL[1:0]: bits (OCTOSPI1 Kernel Clock Source Selection)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCLK</name>
                  <description>SYSCLK clock used as OctoSPI kernel clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIK</name>
                  <description>MSIK clock used as OctoSPI kernel clock source</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL1</name>
                  <description>PLL1 "Q" clock used as OctoSPI kernel clock source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2</name>
                  <description>PLL2 "Q" clock used as OctoSPI kernel clock source</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR3</name>
          <description>IPs Clocks Configuration Register 3</description>
          <addressOffset>0xe8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LPUART1SEL</name>
              <description>LPUART1SEL[2:0]: bits (LPUART1 Kernel Clock Source Selection)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCLK3</name>
                  <description>PCLK3 clock used as LPUART1 clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCLK</name>
                  <description>SYSCLK clock used as LPUART1 clock source</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>HSI clock used as LPUART1 clock source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>LSE clock used as LPUART1 clock source</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIK</name>
                  <description>MSIK clock used as LPUART1 clock source</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI3SEL</name>
              <description>SPI3SEL[1:0]: bits (SPI3 Kernel Clock Source Selection)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>I2C3SEL</name>
              <description>I2C3SEL[1:0]: bits (I2C3 Kernel Clock Source Selection)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LPTIM34SEL</name>
              <description>LPTIM34SEL[1:0]: bits (LPTIM3 and LPTIM4 Kernel Clock Source Selection)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LPTIM1SEL</name>
              <description>LPTIM1SEL[1:0]: bits (LPTIM1 Kernel Clock Source Selection)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ADCDACSEL</name>
              <description>ADCDACSEL[2:0]: bits (ADC1, ADC4 and DAC1 Kernel Clock Source Selection)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HCLK</name>
                  <description>No clock used as ADCx/DAC1 clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCLK</name>
                  <description>SYSCLK clock used as ADCx/DAC1 clock source</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2</name>
                  <description>PLL2 clock used as ADCx/DAC1 clock source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>HSE clock used as ADCx/DAC1 clock source</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>HSI clock used as ADCx/DAC1 clock source</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIK</name>
                  <description>MSIK clock used as ADCx/DAC1 clock source</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAC1SEL</name>
              <description>DAC1 Sample &amp; Hold Clock Source Selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>LSE clock used as DAC1 clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSI</name>
                  <description>LSI clock used as DAC1 clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADF1SEL</name>
              <description>ADF1SEL[2:0]: bits (ADF1 Kernel Clock Source Selection)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HCLK</name>
                  <description>HCLK clock used as ADF1 clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL1</name>
                  <description>PLL1 clock used as ADF1 clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3</name>
                  <description>PLL3 clock used as ADF1 clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSIK</name>
                  <description>MSIK clock used as ADF1 clock</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN</name>
                  <description>PIN SAI1_EXTCLK clock used as ADF1 clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
